#include <iostream>
using namespace std;

int main()
{
    system("chcp 1251");
    double x1, y1, x2, y2, x3, y3, x4, y4, x5, y5, square;
    cout << "Введите координаты первой точки(через пробел): ";
    cin >> x1 >> y1;
    cout << "Введите координаты второй точки(через пробел): ";
    cin >> x2 >> y2;
    cout << "Введите координаты третьей точки(через пробел): ";
    cin >> x3 >> y3;
    cout << "Введите координаты четвертой точки(через пробел): ";
    cin >> x4 >> y4;
    cout << "Введите координаты пятой точки(через пробел): ";
    cin >> x5 >> y5;
    square = 0.5 * abs(x1 * y2 + x2 * y3 + x3 * y4 + x4 * y5 + x5 * y1 - x2 * y1 - x3 * y2 - x4 * y3 - x5 * y4 - x1 * y5);
    cout << "Площадь пятиугольника: " << square;
    return 0;
}
